{
  "products": [
    {
      "product_id": "macbook_pro_m3_2024",
      "name": "MacBook Pro 14-inch M3 2024",
      "image": "images/mbp.png",
      "description": "The MacBook Pro 14-inch with M3 chip represents Apple's most advanced professional laptop, built on groundbreaking 3-nanometer technology that delivers unprecedented performance and efficiency. At its heart lies the revolutionary M3 chip featuring an 8-core CPU (4 performance cores and 4 efficiency cores), 10-core GPU with Dynamic Caching and hardware-accelerated ray tracing, and a 16-core Neural Engine capable of 18 trillion operations per second for advanced machine learning tasks. The display is a masterpiece: a 14.2-inch Liquid Retina XDR screen with 3024x1964 native resolution (254 pixels per inch), offering extreme dynamic range with 1000 nits sustained brightness and up to 1600 nits peak brightness for HDR content. With support for 1 billion colors, P3 wide color gamut, and True Tone technology, it delivers cinema-grade color accuracy. ProMotion technology enables adaptive refresh rates from 47.95Hz to 120Hz for incredibly smooth scrolling and responsive performance. The system includes 8GB of unified memory with 100GB/s memory bandwidth (configurable up to 24GB), and ultrafast 512GB SSD storage with sequential read speeds up to 3000MB/s (expandable to 2TB). Three Thunderbolt 4 (USB-C) ports support charging, DisplayPort, Thunderbolt 4 (up to 40Gb/s), and USB 4 (up to 40Gb/s), plus dedicated HDMI 2.1 port supporting 4K displays at 240Hz or 8K displays at 60Hz, SDXC card slot for professional photography workflows, and MagSafe 3 magnetic charging port with fast charge capability (50% in 30 minutes with 96W adapter). The audio system features six speakers with force-cancelling woofers for deep bass and minimal distortion, supporting Spatial Audio with Dolby Atmos for immersive sound. Three studio-quality microphones with high signal-to-noise ratio and directional beamforming capture crystal-clear audio. The 1080p FaceTime HD camera with advanced image signal processor delivers sharp video calls even in low light. Touch ID integrated into the keyboard provides secure authentication and Apple Pay authorization. The backlit Magic Keyboard features full-height function keys, ambient light sensor, and comfortable key travel. The Force Touch trackpad is massive (5.9 inches diagonal) with precise cursor control and pressure-sensing capabilities. Connectivity includes Wi-Fi 6E (802.11ax) with 2x2 MIMO for speeds up to 2.4Gb/s, and Bluetooth 5.3 for wireless accessories. The 70-watt-hour lithium-polymer battery delivers up to 22 hours of Apple TV app movie playback, 15 hours of wireless web browsing, and supports fast charging. Physical dimensions are 12.31 inches (31.26 cm) wide, 8.71 inches (22.12 cm) deep, and just 0.61 inches (1.55 cm) thin, weighing only 3.5 pounds (1.6 kg). The precision-milled aluminum unibody enclosure is available in Space Gray and Silver finishes. Runs macOS Sonoma with advanced features including Stage Manager for window organization, Continuity Camera using iPhone as webcam, Universal Control for seamless Mac and iPad integration, Focus modes for productivity, iCloud integration, Time Machine backup, FileVault encryption, and compatibility with thousands of professional applications including Final Cut Pro, Logic Pro, Xcode, Adobe Creative Cloud, Microsoft Office, and more. Environmental commitments include 100% recycled aluminum in the enclosure, 100% recycled rare earth elements in magnets, and arsenic-free display glass. Includes 67W USB-C Power Adapter and USB-C to MagSafe 3 Cable (2m). Supports one external display up to 6K resolution at 60Hz. Perfect for professional content creation, software development, 3D rendering, video editing, music production, graphic design, data science, and demanding multitasking workflows.",
      "reviews": [
        {
          "review_id": "mbp_r001",
          "content": "Absolutely phenomenal machine! The M3 chip handles 4K video editing like butter. I can run Final Cut Pro, Logic Pro, and multiple Chrome tabs simultaneously without any lag. Battery life is incredible - easily lasts me through a full workday and then some. The display is stunning, colors are so vibrant and accurate. Best laptop I've ever owned!",
          "rating": 5.0,
          "date": "2024-11-20"
        },
        {
          "review_id": "mbp_r002",
          "content": "Coming from a Windows PC, the transition was smooth. The build quality is impeccable - feels premium and solid. The keyboard is comfortable for long typing sessions. MagSafe charging is genius, saved my laptop from falling multiple times. Speakers are shockingly good for a laptop. Development work is a breeze with Docker and multiple IDEs running.",
          "rating": 5.0,
          "date": "2024-11-18"
        },
        {
          "review_id": "mbp_r003",
          "content": "Great performance but the price is really steep. For what you pay, you'd expect at least 16GB RAM as standard. 8GB feels limiting when running virtual machines. Also, the lack of USB-A ports is annoying - have to carry dongles everywhere. Otherwise, it's a solid machine.",
          "rating": 3.5,
          "date": "2024-11-15"
        },
        {
          "review_id": "mbp_r004",
          "content": "The display is absolutely gorgeous! Perfect for photo editing with its color accuracy and brightness. The notch doesn't bother me at all. Face ID would've been nice but Touch ID works well. The trackpad is the best I've used - so smooth and responsive. Compiling code is lightning fast compared to my old Intel Mac.",
          "rating": 5.0,
          "date": "2024-11-12"
        },
        {
          "review_id": "mbp_r005",
          "content": "Battery life is not as advertised. I get about 12-15 hours with my workflow, not 22. Still good, but misleading marketing. The laptop runs warm when under heavy load, though never uncomfortably hot. Screen is beautiful but gets quite reflective in bright environments. Still a good purchase overall.",
          "rating": 4.0,
          "date": "2024-11-10"
        },
        {
          "review_id": "mbp_r006",
          "content": "This is my first Mac and I'm blown away! The ecosystem integration with my iPhone and iPad is seamless. AirDrop works flawlessly. The silent operation is amazing - no fan noise even when rendering videos. The Liquid Retina display makes everything look crisp. Highly recommend for anyone in the Apple ecosystem!",
          "rating": 5.0,
          "date": "2024-11-08"
        },
        {
          "review_id": "mbp_r007",
          "content": "Disappointed with the storage options. 512GB fills up quickly with large projects. Should have gotten the 1TB model but the price jump is ridiculous. Also, the base 8GB RAM is a joke in 2024. Apple is clearly nickel and diming customers. The performance is great when it doesn't hit memory pressure though.",
          "rating": 3.0,
          "date": "2024-11-05"
        },
        {
          "review_id": "mbp_r008",
          "content": "Perfect for software development! Xcode runs smoothly, iOS simulator is fast, and multiple virtual machines don't slow it down. The three Thunderbolt ports are sufficient for my setup. Love the physical function keys row. Keyboard has great travel and doesn't feel mushy. Migration from my old Mac was seamless with Migration Assistant.",
          "rating": 5.0,
          "date": "2024-11-02"
        },
        {
          "review_id": "mbp_r009",
          "content": "The speakers are phenomenal! Can't believe the sound quality coming from such a thin laptop. Video calls look great with the improved camera. The six-speaker system with Spatial Audio makes watching movies a treat. However, the webcam is still just 1080p - would've loved 4K in this price range.",
          "rating": 4.5,
          "date": "2024-10-30"
        },
        {
          "review_id": "mbp_r010",
          "content": "Had major compatibility issues with some professional audio software. Not all plugins are optimized for Apple Silicon yet. Had to run some apps through Rosetta 2 which defeats the purpose of the M3. Do your research on software compatibility before buying. Hardware is excellent, but software ecosystem still catching up.",
          "rating": 3.0,
          "date": "2024-10-28"
        },
        {
          "review_id": "mbp_r011",
          "content": "Upgraded from M1 MacBook Air and the difference is night and day! The additional ports are super convenient. The improved sustained performance means no throttling during long renders. The HDR display makes content creation work stunning. Worth every penny for professional work. Gaming performance is surprisingly decent too!",
          "rating": 5.0,
          "date": "2024-10-25"
        },
        {
          "review_id": "mbp_r012",
          "content": "The laptop is heavy for its size. After carrying it in my backpack all day, I feel the weight. The sharp edges on the chassis can dig into your wrists during extended typing. Screen is beautiful but the high resolution drains battery faster when at maximum brightness. Good laptop but not perfect.",
          "rating": 3.5,
          "date": "2024-10-22"
        },
        {
          "review_id": "mbp_r013",
          "content": "As a data scientist, this machine handles large datasets with ease. Python notebooks run smoothly, machine learning model training is fast, and the thermal management is impressive. RAM feels adequate for most tasks but wish I could upgrade it later. The unified memory architecture is efficient but not expandable which is limiting.",
          "rating": 4.0,
          "date": "2024-10-20"
        },
        {
          "review_id": "mbp_r014",
          "content": "The HDMI port is a game changer! No more dongles for presentations. SDXC card slot is super convenient for photography work. Build quality is exceptional - feels like it'll last for years. The Space Black color is gorgeous and resists fingerprints better than I expected. Minor complaint: keyboard backlighting could be brighter.",
          "rating": 4.5,
          "date": "2024-10-18"
        },
        {
          "review_id": "mbp_r015",
          "content": "Terrible value for money. You can get a Windows laptop with better specs for half the price. The Apple tax is real. Yes, macOS is nice but not worth the premium. The base configuration is a ripoff - forces you to spend more on upgrades. Feels like planned obsolescence with non-upgradeable RAM and storage.",
          "rating": 2.0,
          "date": "2024-10-15"
        },
        {
          "review_id": "mbp_r016",
          "content": "The trackpad is incredible! Gestures are so intuitive and responsive. The haptic feedback feels natural. Precision is unmatched - best trackpad I've ever used. Makes me not want to use a mouse. Touch ID is fast and convenient. The quality of materials used throughout is evident. This is what a premium laptop should feel like.",
          "rating": 5.0,
          "date": "2024-10-12"
        },
        {
          "review_id": "mbp_r017",
          "content": "Screen uniformity issues on my unit - slight backlight bleeding in the corners. Also noticed some minor light leakage around the notch in dark environments. For a $2000+ laptop, QC should be better. Apple Store was helpful with the exchange process, but shouldn't have happened in the first place. Replacement unit is perfect though.",
          "rating": 3.5,
          "date": "2024-10-10"
        },
        {
          "review_id": "mbp_r018",
          "content": "The M3 chip is a beast for 3D rendering! Blender performance is outstanding. The Metal acceleration makes a huge difference. Fans rarely spin up even under heavy workloads. The cool and quiet operation is impressive. Battery efficiency during intensive tasks is remarkable. Can render complex scenes on battery power without issues.",
          "rating": 5.0,
          "date": "2024-10-08"
        },
        {
          "review_id": "mbp_r019",
          "content": "Coming from Windows, I miss some features. No touchscreen feels archaic in 2024. Window management in macOS is clunky compared to Windows 11. Some keyboard shortcuts are unintuitive. Gaming support is poor - most titles don't run well or at all. If you're deep in the Apple ecosystem it's great, otherwise it's limiting.",
          "rating": 3.0,
          "date": "2024-10-05"
        },
        {
          "review_id": "mbp_r020",
          "content": "This laptop has transformed my workflow! The speed of opening apps, switching between tasks, and handling multitasking is phenomenal. Never any beach ball or lag. The MagSafe connector is satisfying to connect and disconnect. Having HDMI and SD card built-in is so practical. The display makes everything look professional. Couldn't be happier with this purchase!",
          "rating": 5.0,
          "date": "2024-10-02"
        }
      ]
    },
    {
      "product_id": "iphone_15_pro_max_2024",
      "name": "iPhone 15 Pro Max 256GB",
      "image": "images/iphone.webp",
      "description": "The iPhone 15 Pro Max represents the absolute pinnacle of smartphone engineering, powered by the groundbreaking A17 Pro chip - the industry's first 3-nanometer smartphone processor delivering unprecedented performance and efficiency. The A17 Pro features a new 6-core CPU (2 performance cores up to 10% faster and 4 efficiency cores up to 3x faster than A16), a completely redesigned 6-core GPU with hardware-accelerated ray tracing (4x faster than software-based), and advanced 16-core Neural Engine performing 35 trillion operations per second for sophisticated machine learning and computational photography. The display is a marvel of technology: a 6.7-inch Super Retina XDR OLED screen with 2796x1290 pixel resolution at 460 pixels per inch, delivering extraordinary clarity and detail. ProMotion technology provides adaptive refresh rates from 1Hz to 120Hz for fluid scrolling and responsive touch input while conserving battery. Peak brightness reaches 2000 nits for outdoor visibility in direct sunlight, with typical brightness of 1000 nits and precise 2,000,000:1 contrast ratio. The display supports HDR with Dolby Vision, wide color (P3), True Tone for natural color temperature adjustment, and haptic touch for contextual menus. Always-On display keeps important information visible with minimal power consumption. Protected by Ceramic Shield front cover - tougher than any smartphone glass with 4x better drop performance. The revolutionary aerospace-grade titanium frame (Grade 5 titanium alloy) with brushed finish makes it the lightest Pro model ever at just 221 grams (7.81 ounces), yet incredibly strong and premium. Physical dimensions are 6.29 inches (159.9 mm) tall, 3.02 inches (76.7 mm) wide, and remarkably thin at 0.32 inches (8.25 mm). The pro camera system is extraordinary: 48MP Main (wide) camera with second-generation sensor-shift optical image stabilization, ƒ/1.78 aperture, 24mm equivalent focal length, sensor size 65% larger than iPhone 14 Pro, enabling quad-pixel sensor technology for 12MP or 48MP output with incredible low-light performance and detail. Next-generation portraits with Focus and Depth Control allow adjustment after capture. 12MP Ultra Wide camera with ƒ/2.2 aperture, 13mm equivalent, 120° field of view enabling macro photography as close as 2cm. Advanced 12MP Telephoto camera with ƒ/2.8 aperture offering 5x optical zoom (120mm equivalent focal length), tetraprism design with optical image stabilization for steady long-range shots. Total zoom range: 0.5x, 1x, 2x, 3x, 5x optical and up to 25x digital zoom. Photonic Engine enhances all photos with improved color, texture, and low-light performance. Smart HDR 5 recognizes up to 4 people and optimizes each individually. Video capabilities are professional-grade: 4K Dolby Vision at up to 60fps, 4K ProRes at 60fps (up to 4K 30fps when recording to external storage via USB 3), Cinematic mode in 4K at 30fps with real-time focus transitions, Action mode for incredible stabilization, and ability to capture spatial photos and videos for Apple Vision Pro. Advanced video features include Log encoding for color grading flexibility, Academy Color Encoding System, and ProRes encoding. The customizable Action button replaces the ring/silent switch, enabling quick access to camera, flashlight, voice memo, Focus mode, translation, accessibility features, or shortcuts - all with a single press. USB-C connector with USB 3.2 Gen 2 provides transfer speeds up to 10Gb/s (20x faster than USB 2.0), enabling professional video workflows and fast backups. Supports DisplayPort for external displays up to 4K at 60Hz. Advanced connectivity includes 5G (sub-6 GHz and mmWave) with 4x4 MIMO and LAA for blazing-fast downloads up to 4Gb/s, Gigabit LTE with 4x4 MIMO, Wi-Fi 6E (802.11ax) with 2x2 MIMO supporting speeds up to 2.4Gb/s across 2.4GHz, 5GHz, and 6GHz bands, Bluetooth 5.3 with enhanced range and efficiency, Ultra Wideband (UWB) second-generation chip for precise spatial awareness enabling Precision Finding for AirTags, Thread network protocol for smart home devices, and NFC with reader mode for Apple Pay and digital keys. Dual eSIM support (no physical SIM tray in US models) enables two active lines simultaneously. Face ID - the most secure facial authentication system - uses TrueDepth camera with dot projector, flood illuminator, and infrared camera for secure unlock even in darkness. Advanced sensors include LiDAR Scanner for Night mode portraits and AR experiences, barometer, high dynamic range gyroscope, high-g accelerometer enabling Crash Detection (automatically calls emergency services if severe car crash detected), ambient light sensor, and proximity sensor. Emergency SOS via satellite enables texting emergency services and sharing location when cellular coverage unavailable (requires clear view of sky). Roadside Assistance via satellite provides help when stranded. Battery life is exceptional: up to 29 hours video playback, 25 hours streaming video, 95 hours audio playback. Supports MagSafe wireless charging up to 15W with magnetic alignment, Qi wireless charging up to 7.5W, and fast wired charging with 20W+ adapter (50% in 30 minutes). Water and dust resistance rated IP68 under IEC standard 60529 (maximum depth of 6 meters for up to 30 minutes). Available in four stunning titanium finishes: Natural Titanium with exposed metal, Blue Titanium, White Titanium, and Black Titanium - all with color-infused glass back featuring matte texture. Runs iOS 17 with groundbreaking features: StandBy mode transforms iPhone into smart display while charging in landscape, Live Voicemail with real-time transcription, NameDrop for easy contact sharing by bringing iPhones together, Contact Posters for customized caller ID, enhanced autocorrect with transformer language model, offline maps, Journal app for reflection and memories, interactive widgets, FaceTime video voicemail, improved Messages search, Safety Check for domestic abuse situations, Medical ID accessible from lock screen, Check In to share arrival status, and privacy features like app privacy reports and Mail Privacy Protection. Compatible with entire ecosystem including AirPods with seamless switching, Apple Watch for health tracking and notifications, HomePod for spatial audio handoff, Mac with Universal Clipboard and AirDrop, iPad with Sidecar, Apple TV with AirPlay, and Apple Vision Pro for spatial computing. Accessibility features include VoiceOver screen reader, Magnifier, Voice Control, AssistiveTouch, and Live Speech. Environmental responsibility includes 100% recycled cobalt in battery, 100% recycled gold and copper in camera wire, 100% recycled aluminum in frame, and 75% recycled aluminum in other components. Box includes iPhone 15 Pro Max, USB-C to USB-C cable (1m), and documentation. Power adapter and EarPods sold separately. Perfect for professional photography, videography, mobile gaming, productivity, content creation, augmented reality, health tracking, and seamless ecosystem integration.",
      "reviews": [
        {
          "review_id": "iph_r001",
          "content": "Best iPhone ever made! The titanium frame feels incredibly premium and is noticeably lighter than my 14 Pro Max. The Action button is genius - I have it set to launch my camera instantly. The A17 Pro is blazingly fast, apps open instantly, and gaming performance is console-quality. Battery easily lasts me through a full day of heavy use. Camera quality is phenomenal, especially in low light!",
          "rating": 5.0,
          "date": "2024-11-22"
        },
        {
          "review_id": "iph_r002",
          "content": "The camera system is mind-blowing! The 48MP sensor captures incredible detail. Portrait mode is significantly improved with better edge detection. Night mode produces photos that look like they were taken in daylight. The 5x optical zoom on the telephoto lens is a game changer for concerts and sports events. ProRes video recording is professional grade.",
          "rating": 5.0,
          "date": "2024-11-20"
        },
        {
          "review_id": "iph_r003",
          "content": "Extremely overpriced for minimal upgrades from the 14 Pro Max. The Action button is a gimmick that I rarely use. USB-C is great but should've happened years ago. Titanium looks nice but scratches easily - already have micro scratches after two weeks with a case. The price increase isn't justified by the features. Feels like Apple is coasting.",
          "rating": 2.5,
          "date": "2024-11-18"
        },
        {
          "review_id": "iph_r004",
          "content": "Love the switch to USB-C! Finally one cable for everything. The faster charging and data transfer speeds are noticeable. The display is gorgeous - colors pop and the 120Hz makes everything buttery smooth. Face ID works flawlessly even in low light. Dynamic Island is actually useful for multitasking. The ecosystem integration is unmatched.",
          "rating": 5.0,
          "date": "2024-11-16"
        },
        {
          "review_id": "iph_r005",
          "content": "Battery life is disappointing. Barely makes it through a full day with moderate use. The phone gets noticeably warm during intensive tasks like gaming or video recording. The titanium frame shows fingerprints badly - constantly wiping it clean. The Action button is awkwardly placed and I keep accidentally pressing it. Expected better for $1200.",
          "rating": 3.0,
          "date": "2024-11-14"
        },
        {
          "review_id": "iph_r006",
          "content": "Upgraded from iPhone 12 and the difference is staggering! The camera upgrade alone is worth it - photos look professional. The speed is incredible, Face ID is instantaneous, and the Always-On display is super convenient. The build quality is exceptional, feels like a luxury item. Battery life gets me through the day easily. Very happy with this purchase!",
          "rating": 5.0,
          "date": "2024-11-12"
        },
        {
          "review_id": "iph_r007",
          "content": "The lack of a SIM card tray is frustrating for international travel. eSIM support isn't universal yet. The titanium finish on my Blue model has developed a weird patina after just a month. AppleCare+ is almost mandatory given how expensive repairs are. The phone is still slippery despite the textured back - definitely need a case. Good phone but with annoying compromises.",
          "rating": 3.5,
          "date": "2024-11-10"
        },
        {
          "review_id": "iph_r008",
          "content": "The ProMotion display is absolutely stunning! Scrolling is silky smooth and responsive. The Always-On display is practical and looks great. Ceramic Shield really works - dropped it twice and no cracks. The Spatial Audio speakers are impressive for a phone. Gaming at 120Hz is incredible. iOS 17 runs flawlessly with no bugs or crashes.",
          "rating": 5.0,
          "date": "2024-11-08"
        },
        {
          "review_id": "iph_r009",
          "content": "Camera quality is excellent in good lighting but disappointing in challenging conditions. Still see noise in low light despite the larger sensor. The zoom quality at 5x isn't as sharp as advertised. Portrait mode still struggles with hair detail. Video stabilization is good but not groundbreaking. For a 'Pro' camera phone, expected more.",
          "rating": 3.5,
          "date": "2024-11-06"
        },
        {
          "review_id": "iph_r010",
          "content": "The A17 Pro chip is overkill for everyday tasks but future-proofing is nice. Heavy apps and games run perfectly. The neural engine makes photo processing instantaneous. Face ID is noticeably faster than my old phone. The 256GB storage is adequate but wish the base model was 256GB given the price. Build quality is impeccable.",
          "rating": 4.5,
          "date": "2024-11-04"
        },
        {
          "review_id": "iph_r011",
          "content": "Worst iPhone I've owned. Constant software bugs - apps crashing, random reboots, Face ID failing. The phone overheats even with light use. Battery drains absurdly fast, barely lasts half a day. Apple Support has been unhelpful. Feels like a beta product. Deeply regret this $1200 purchase. Should've waited for the 16 or stuck with my 13 Pro.",
          "rating": 1.5,
          "date": "2024-11-02"
        },
        {
          "review_id": "iph_r012",
          "content": "The titanium design is beautiful and the weight reduction is noticeable. Feels less fatiguing to hold for extended periods. The matte finish resists fingerprints better than stainless steel. Action button is super handy for quick voice memos. USB-C compatibility with my MacBook cables is convenient. Premium in every way. Worth the upgrade!",
          "rating": 5.0,
          "date": "2024-10-30"
        },
        {
          "review_id": "iph_r013",
          "content": "Screen is gorgeous but the notch is still annoying in 2024. Dynamic Island is cool but mostly just shows music controls. The lack of TouchID is frustrating when wearing a mask. No Apple Pencil support is a missed opportunity. The camera bump is massive - phone wobbles on flat surfaces. Good but not great.",
          "rating": 3.5,
          "date": "2024-10-28"
        },
        {
          "review_id": "iph_r014",
          "content": "The ecosystem integration is unbeatable! Seamless handoff with my Mac, instant AirDrop, shared clipboard across devices - everything just works. iMessage improvements are great. The Standby mode turns it into a perfect bedside clock. Widgets are finally useful. iOS 17 is polished and intuitive. The best smartphone experience available.",
          "rating": 5.0,
          "date": "2024-10-26"
        },
        {
          "review_id": "iph_r015",
          "content": "Terrible value proposition. Minor upgrades for a huge price increase. The Action button is useless. Titanium scratches easier than steel. Camera improvements are marginal at best. Battery life is worse than my 14 Pro Max. Apple is charging more while delivering less innovation. Feels like they're milking loyal customers. Very disappointed.",
          "rating": 2.0,
          "date": "2024-10-24"
        },
        {
          "review_id": "iph_r016",
          "content": "The cinematic mode and ProRes recording capabilities are professional-grade. Edited a short film entirely shot on this iPhone - the quality is broadcast-ready. The color accuracy and dynamic range are exceptional. Log recording gives incredible flexibility in post. Audio recording quality with the array of microphones is excellent. A genuine creative tool!",
          "rating": 5.0,
          "date": "2024-10-22"
        },
        {
          "review_id": "iph_r017",
          "content": "Emergency SOS via satellite gave me peace of mind during a hiking trip. Crash Detection is a great safety feature even if I hope to never use it. The water resistance is legit - survived a drop in the pool. Build quality inspires confidence. However, the lack of a sim ejector tool in the box is cheap. Should include basic accessories at this price.",
          "rating": 4.0,
          "date": "2024-10-20"
        },
        {
          "review_id": "iph_r018",
          "content": "Face ID works great until you're lying down in bed - then it's a nightmare. Still wish Apple would add an under-display fingerprint sensor. The always-on display drains battery noticeably. The phone is too big for one-handed use - constantly doing hand gymnastics. Screen is beautiful but 6.7 inches is unwieldy for smaller hands.",
          "rating": 3.0,
          "date": "2024-10-18"
        },
        {
          "review_id": "iph_r019",
          "content": "Gaming performance is incredible! Genshin Impact runs at max settings without frame drops. The A17 Pro with hardware ray tracing makes games look stunning. The display's 120Hz refresh rate is perfect for competitive gaming. The large screen is great for gaming but the phone does get warm during extended sessions. Best gaming phone I've owned.",
          "rating": 4.5,
          "date": "2024-10-16"
        },
        {
          "review_id": "iph_r020",
          "content": "Absolutely love this phone! Every detail is refined and polished. The haptic feedback is precise and satisfying. The stereo speakers sound amazing. The MagSafe charging is convenient and fast. The camera captures memories beautifully - photos of my kids are stunning. Battery improvement is noticeable from my 13 Pro. This phone does everything I need perfectly!",
          "rating": 5.0,
          "date": "2024-10-14"
        }
      ]
    }
  ]
}

